Catalogs/ПравоваяБаза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПравоваяБаза</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ФайлыВБазе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФайлыВБазе</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыПользователям</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗанятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОзнакомлениеСПравовойБазой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ОзнакомлениеСПравовойБазой</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ознакомлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравоваяБаза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПравоваяБаза/Forms/ФормаНеОзнакомленных/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		
		Отказ = Истина;
		
	Иначе
		
		Должность = Пользователь.ФизическоеЛицо.ОсновнаяДолжность;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Должность", Должность);
		Запрос.УстановитьПараметр("Сотрудник", Пользователь);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыВБазе.Объект,
		|	МАКСИМУМ(ФайлыВБазе.НомерВерсии) КАК НомерВерсии
		|ПОМЕСТИТЬ ФайлыДолжности
		|ИЗ
		|	РегистрСведений.ФайлыВБазе КАК ФайлыВБазе
		|ГДЕ
		|	ФайлыВБазе.Объект.Должности.Должность В(&Должность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ФайлыВБазе.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФайлыДолжности.Объект КАК Значение
		|ИЗ
		|	ФайлыДолжности КАК ФайлыДолжности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОзнакомлениеСПравовойБазой КАК ОзнакомлениеСПравовойБазой
		|		ПО (ОзнакомлениеСПравовойБазой.Сотрудник = &Сотрудник)
		|			И (ФайлыДолжности.Объект = ВЫБОР
		|				КОГДА ОзнакомлениеСПравовойБазой.Объект = ЗНАЧЕНИЕ(Справочник.ПравоваяБаза.ПустаяСсылка)
		|					ТОГДА ФайлыДолжности.Объект
		|				ИНАЧЕ ОзнакомлениеСПравовойБазой.Объект
		|			КОНЕЦ)
		|			И (ФайлыДолжности.НомерВерсии = ВЫБОР
		|				КОГДА ОзнакомлениеСПравовойБазой.НомерВерсии = 0
		|					ТОГДА ФайлыДолжности.НомерВерсии
		|				ИНАЧЕ ОзнакомлениеСПравовойБазой.НомерВерсии
		|			КОНЕЦ)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОзнакомлениеСПравовойБазой.Ознакомлен ЕСТЬ NULL 
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ОзнакомлениеСПравовойБазой.Ознакомлен
		|		КОНЕЦ = ЛОЖЬ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Список.Добавить(Выборка.Значение);
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Список.Количество() = 0 Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СсылкаНаПравовуюБазу = Элемент.ТекущиеДанные.Значение;
	ОткрытьФорму("Справочник.ПравоваяБаза.ФормаОбъекта", Новый Структура("Ключ", СсылкаНаПравовуюБазу));
	
КонецПроцедуры
